[
	{
		"id": 0,
		"title": "Mode",
		"logo": "/data/images/airdrops/mode-logo.jpg",
		"start": "2024-02-15",
		"end": "2024-03-15",
		"amount": 550000000,
		"value": 550000000,
		"platform": 56,
		"description": "Mode is an Ethereum layer-2 blockchain designed for hyper-growth. Mode is built using Optimism's OP Stack which enables rapid application development and deployment of EVM-compatible applications. The goal of Mode is to empower developers and users to grow an ecosystem of world-class applications and be directly rewarded for their contribution to the ecosystem through referral and contract-secured revenue.",
		"claimURL": "https://app.mode.network/early/"
	},
	{
		"id": 1,
		"title": "B² Network",
		"logo": "/data/images/airdrops/B²-Network-logo.jpg",
		"start": "2024-02-15",
		"end": "2024-03-15",
		"amount": 20000,
		"value": 20000,
		"platform": 56,
		"description": "B² Network is a Layer-2 solution that bolsters transaction speed and broadens application diversity without sacrificing security. B² Network is the first zero-knowledge proof verification commitment rollup on Bitcoin. Leveraging rollup technology, B² Network provides a platform capable of running Turing-complete smart contracts for off-chain transactions, which enhances transaction efficiency and minimizes costs. B² Network, backed by HashKey Capital, OKX Ventures, KuCoin Ventures and many more, is airdropping 5% of the total supply to users who join the Buzz airdrop campaign. Sign up and deposit tokens to earn points in the form of parts. Also, earn more parts for each referral. Parts can be converted to built rigs, which can then be used to earn B² Network token.",
		"claimURL": "https://buzz.bsquared.network/?code=IrsRO"
	},
	{
		"id": 2,
		"title": "beoble",
		"logo": "https://airdrops.io/wp-content/uploads/2024/02/beoble-logo.jpg",
		"platform": 1,
		"description": "<p>beoble is the Whatsapp for Web3. Their chat app allows crypto wallet owners to message each other, and their integration toolkit allows Dapps to add a great communication experience to their products fast.</p> <p>beoble had raised $2M in funding from investors like HashKey Capital and Samsung Next. They have confirmed to launch the CAT token and do an airdrop to users who collect points. Sign up at beoble and complete simple tasks to earn points. Also, earn more points for each referral. The points will be converted to CAT tokens in the future.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/6dm2/' rel='nofollow' target='_blank'>beoble app page</a>.</li> <li>Connect and verify your wallet.</li> <li>Now enter our unlimited referral code &ldquo;<strong>09c70c7c-4793-4cc5-b680-4428c79ca32d</strong>&rdquo; and sign up.</li> <li>You&rsquo;ll receive a bonus of 20 points when you sign up using the code above.</li> <li>Now complete simple tasks to earn more points.</li> <li>You can get points for logging in daily, sending messages, reacting to messages and more.</li> <li>Also, earn 20 points for inviting your friends.</li> <li>They&rsquo;ve <a href='https://airdrops.io/visit/7dm2/' rel='nofollow' target='_blank'>confirmed</a> to airdrop CAT tokens to users who collect points.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p>",
		"claimURL": "https://airdrops.io/visit/6dm2/"
	},
	{
		"id": 3,
		"title": "Bluefin",
		"logo": "https://airdrops.io/wp-content/uploads/2024/02/Bluefin-logo.jpg",
		"platform": "sui",
		"description": "<p>Bluefin aims to offer traders a more performant, low-cost, and Web2-like user experience. Over the course of this year, they&#39;ve rewritten their codebase and built on a new underlying technology. Bluefin is built on Sui, which enables horizontally scalable performance and a wallet-less trading experience that competes with the user experience of a centralized exchange.</p> <p>Bluefin (previously Firefly) has raised a total of $4M from investors like Polychain Capital and Huobi. They&rsquo;ve confirmed to launch &ldquo;BLUE&rdquo; token, and users who trade earn BLUE points, which will then be converted to BLUE tokens at a 1:1 ratio at TGE. Also, earn 10% rewards from each referral, and users who sign up using the below link will also get a 10% bonus reward.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/1am2/' rel='nofollow' target='_blank'>Bluefin website</a>.</li> <li>Connect your Sui wallet like this <a href='https://airdrops.io/visit/2am2/' rel='nofollow' target='_blank'>wallet</a> by Sui.</li> <li>Accept the terms and complete the onboarding.</li> <li>Go to &ldquo;Account&rdquo; and enter &ldquo;<strong>v2-2kw0ud</strong>&rdquo; in the referral code field.</li> <li>You will get a 10% bonus reward on trading if you use the above code.</li> <li>Now you will need some SUI and USDC. You can get it on <a href='https://airdrops.io/goto/binance/' rel='nofollow' target='_blank'>Binance</a>.</li> <li>Bluefin currently supports only USDCeth, so bridge USDC only from Ethereum. You can use the <a href='https://airdrops.io/visit/sgl2/' rel='nofollow' target='_blank'>Portal bridge</a> powered by Wormhole.</li> <li>Go back to Bluefin, click on &ldquo;Deposit&rdquo; and deposit USDCeth.</li> <li>Now make trades on perpetuals.</li> <li>&nbsp;You will earn BLUE points for making trades plus the bonus 10% if you&rsquo;ve used the above code.</li> <li>BLUE points will be converted to BLUE tokens at a 1:1 ratio at TGE.</li> <li>A total of 6% of the total supply has been allocated to users who collect BLUE points.</li> <li>For more info regarding the rewards, see this <a href='https://airdrops.io/visit/3am2/' rel='nofollow' target='_blank'>page</a>.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p>",
		"claimURL": "https://airdrops.io/visit/1am2/"
	},
	{
		"id": 4,
		"title": "INIT Capital",
		"logo": "https://airdrops.io/wp-content/uploads/2024/01/INIT-Capital-logo.jpg",
		"platform": 5000,
		"description": "<p>INIT Capital aims to democratize access to liquidity, catering not only to DeFi users but also to protocols through &#39;Liquidity Hooks.&#39; Liquidity Hooks serve as plugins for liquidity. DApps developing strategies such as all kinds of vaults, leveraged LP/Farming, perpetual trading, margin trading, LSTFi, etc., can easily build Liquidity Hooks by writing their smart contracts to integrate or &#39;hook&#39; onto INIT and access INIT&rsquo;s liquidity in a permissionless manner. With that, dApps can fully concentrate on catering yield strategies or &#39;Hooks&#39; for end-users.</p> <p>INIT Capital is airdropping free INIT tokens to users who join their &ldquo;Liquidity Hook Era Phase 1&rdquo; campaign. Complete simple social tasks, join the campaign and lend or borrow tokens on the platform to earn INIT points. Refer your friends to earn 10% of the points they earn. The points will be converted to INIT tokens.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/t4m2/' rel='nofollow' target='_blank'>INIT Capital website</a>.</li> <li>Connect your wallet and change the network to Mantle.</li> <li>Now click on &ldquo;Join the Campaign&rdquo;.</li> <li>Follow them on Twitter, join their Discord channel, and verify.</li> <li>You have now joined the campaign.</li> <li>You will need some ETH and/or other tokens on the Mantle network. You can get them from <a href='https://airdrops.io/goto/binance/' rel='nofollow' target='_blank'>Binance</a>.</li> <li>Now, use the <a href='https://airdrops.io/visit/u4m2/' rel='nofollow' target='_blank'>Mantle bridge</a> to bridge tokens from Ethereum Mainnet to Mantle. You will also get some free Mantle (MNT) to cover gas fees.</li> <li>Now, deposit or borrow tokens to start earning points.</li> <li>You will earn 1 INIT point for every $100 value lent per day and 7 INIT points for every $100 value borrowed per day.</li> <li>Also, refer your friends and earn 10% of the points they earn.</li> <li>The INIT points will be converted to INIT tokens after the token goes live.</li> <li>For more information regarding the airdrop, see this <a href='https://medium.com/@InitCapital_/phase-1-money-market-now-live-start-accumulating-your-points-in-the-liquidityhookera-a1558a70c23a' target='_blank'>Medium article</a>.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p>",
		"claimURL": "https://app.init.capital/points?ref=2F0166"
	},
	{
		"id": 5,
		"title": "Laika",
		"logo": "/data/images/laika-logo.jpg",
		"start": "2024-02-15",
		"end": "2024-03-15",
		"amount": 20000,
		"value": 20000,
		"platform": 56,
		"description": "Laika is the first community driven Solana meme SuperVerse, where they unite people across different Metaverses, Chains and Protocols to launch Laika to The Moon in a 3 stage space mission. Laika is more than just a memecoin. Laika is a movement. Laika is proof that if users band together as a global community, they can achieve the impossible. Laika is airdropping a total of $20,000 worth of LAIKA tokens to users who do simple Zealy quests. Join Zealy, complete Laika quests to earn XP, and stand a chance to be among the top 500 participants wo win up to $2,000 worth of LAIKA each. Step-by-Step Guide: Visit the Laika Zealy airdrop page. Connect your wallet and sign up. Now, complete the quests to earn XPs. The top 500 participants on the leaderboard will get rewards as mentioned below: 1st place: $2,000 LAIKA 2nd place: $1,500 LAIKA 3rd place: $1,000 LAIKA 4th and 5th place: $750 LAIKA each 6th to 10th place: $300 LAIKA each 11th to 50th place: $125 LAIKA each 51st to 100th place: $50 LAIKA each 101st to 200th place: $20 LAIKA each 201st to 500th place: $10 LAIKA each",
		"claimURL": "https://zealy.io/cw/laikathecosmodog/questboard",
		"asset": {
			"symbol": "LAIKA",
			"name": "Laika",
			"decimals": 18
		}
	},
	{
		"id": 6,
		"title": "Presearch",
		"logo": "https://airdrops.io/wp-content/uploads/2019/03/Presearch-logo.jpg",
		"platform": 1,
		"description": "<p>Presearch is an open, decentralized search engine that rewards community members with Presearch Tokens for their usage, contribution to, and promotion of the platform.</p> <p>Presearch is airdropping a total of <strong>50M PRE</strong> tokens to search stakers and node runners. A snapshot of the search stakers and node runners was taken on December 29th, 2023. Eligible users will get free PRE based on the stakes as well as a bonus of 2% of the staked tokens per month. New users will get 75 PRE for signing up with our exclusive link and a bonus of 1% of the staked tokens per month.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Create an account at <a href='https://airdrops.io/visit/8rl2/' rel='nofollow' target='_blank'>Presearch</a>.</li> <li>Submit your details and sign up.</li> <li>We have a special offer for all of our readers. Unlike all the other airdrop-related portals, with airdrops.io you get <strong>75 PRE (~$2.5)</strong> tokens for signing up with our ref link, compared to the regular 50 PRE you might find elsewhere.</li> <li>Also, get 75 PRE for each referral.</li> <li>Make sure to earn at least 2.5 PRE by using their &ldquo;<a href='https://airdrops.io/visit/9rl2/' rel='nofollow' target='_blank'>Search engine</a>&rdquo; and be active on the platform for at least 30 days to be eligible to receive the rewards.</li> <li>Node runners and users who had staked PRE on Presearch by December 29th, 2023, will get a share from the <strong>50M PRE</strong> pool.</li> <li>The airdrop will be based on the size of the stake as of the snapshot date.</li> <li>The eligible users will also get a bonus of 2% of the staked tokens per month in addition to the airdrop.</li> <li>New users will get 1% of the staked tokens per month.</li> <li>The rewards will be distributed at the end of each month over a period of 6 months.</li> <li>Random snapshots will be taken monthly to check the stakes of new and old users.</li> <li>For more information regarding the airdrop, see this <a href='https://airdrops.io/visit/arl2/' rel='nofollow' target='_blank'>Medium article</a>.</li> </ol> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p> ",
		"claimURL": "https://account.presearch.com/signup?rid=4776847&promo=airdrops"
	},
	{
		"id": 7,
		"title": "Blast",
		"logo": "https://airdrops.io/wp-content/uploads/2023/11/Blast-logo.jpg",
		"description": "<p>Blast is an L2 with native yield for ETH and stablecoins. Blast yield comes from ETH staking and RWA protocols. The yield from these decentralized protocols is passed back to Blast users automatically. The default interest rate on other L2s is 0%. On Blast, it&#39;s 4% for ETH and 5% for stablecoins. Yield makes it possible to create new revenue streams and provide novel rewards for end-users. Users transact in ETH. Dapps are built around ETH. Blast was designed from the ground up so that ETH itself is natively rebasing on the L2.</p> <p>Blast has raised $20 million from investors like Paradigm and Standard Crypto and has confirmed that it will do an airdrop for early users. Users who sign up with an invite code, bridge ETH and invite friends will get airdrop points. Airdrop points will be convertible to Blast tokens in May.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/bil2/' rel='nofollow' target='_blank'>Blast website</a>.</li> <li>Click on &ldquo;Join Early Access&rdquo;.</li> <li>You will need an invite code to access the platform.</li> <li>Enter our exclusive unlimited invite code &ldquo;<strong>WS7XR</strong>&rdquo; and access the platform.</li> <li>Follow them on <a href='https://twitter.com/Blast_L2' target='_blank'>Twitter</a> and <a href='https://discord.gg/blast-l2' target='_blank'>Discord</a> and click on &ldquo;check your airdrop&rdquo;.</li> <li>Now, connect your wallet.</li> <li>Head over to the Bridge section and transfer ETH or other tokens from Ethereum to Blast L2.</li> <li>You will need some ETH or other tokens supported on Blast to be eligible to bridge. You can get them on <a href='https://airdrops.io/goto/binance/' rel='nofollow' target='_blank'>Binance</a>.</li> <li>You will also earn 4% interest rate for ETH and 5% for stablecoins, whereas on other L2s it&rsquo;s 0%.</li> <li>The tokens that have been bridged can only be withdrawn in February, once the mainnet has launched.</li> <li>You will get one spin per ETH deposited per week.</li> <li>Each spin unlocks a certain number of airdrop points.</li> <li>After you complete your initial bridging, you will receive referral codes. You will only get a certain number of codes in the beginning.</li> <li>The more you and your initially invited friends bridge, the more spins you will earn.</li> <li>All the earned airdrop points can be converted to Blast tokens in May.</li> <li>Also, visit <a href='https://airdrops.io/blaster/'>Blaster</a>, the native DEX on Blast, and join their early access campaign to get free BLSTR tokens based on the amount you&rsquo;ve bridged on Blast. Thereby, you will get BLSTR tokens on top of BLAST tokens.</li> <li>For more information regarding the airdrop, see this <a href='https://airdrops.io/visit/4bl2/' rel='nofollow' target='_blank'>page</a>.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p> ",
		"claimURL": "https://blast.io/en/airdrop/early-access"
	},
	{
		"id": 8,
		"title": "Kinetix Finance",
		"logo": "https://airdrops.io/wp-content/uploads/2024/02/Kinetix-Finance-logo.jpg",
		"platform": 2222,
		"description": "<p>Kinetix is building a comprehensive community-focused DeFi hub designed exclusively for the Kava ecosystem. The Kinetix team is acutely aware of the potential pitfalls of the current crop of centralized trading solutions. While such solutions often offer a more holistic trading experience, including more advanced tooling, leverage, and a variety of tradable assets, they lack transparency and are vulnerable to systemic vulnerabilities.</p> <p>Kinetix Finance is airdropping 3% of the total supply of KFI tokens to early users and various ecosystem users. Cosmos, Osmosis, Injective, Celestia and Polygon stakers and various early users of the platform are eligible for the airdrop. The snapshot has not been taken yet so users could still be eligible for the airdrop.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/ocm2/' rel='nofollow' target='_blank'>Kinetix Finance website</a>.</li> <li>Connect your wallet and change the network to Kava.</li> <li>You will need some KAVA. You can get it on <a href='https://airdrops.io/goto/binance/' rel='nofollow' target='_blank'>Binance</a>.</li> <li>Now, make trades on the platform.</li> <li>Users who trade will get free KFI tokens based on various trading metrics.</li> <li>Cosmos, Osmosis, Injective, Celestia and Polygon stakers are also eligible.</li> <li>The snapshot has not been taken yet, so users could still be eligible for the airdrop.</li> <li>A total of 3% of the total supply has been allocated for the airdrop.</li> <li>For more information regarding the airdrop, see this <a href='https://medium.com/@kinetixfi/breaking-down-the-kfi-airdrop-92db44e98efe' target='_blank'>Medium article</a>.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p> ",
		"claimURL": "https://kinetix.finance/home"
	},
	{
		"id": 9,
		"title": "ClayStack",
		"logo": "https://airdrops.io/wp-content/uploads/2024/02/ClayStack-logo.png",
		"platform": 1,
		"description": "<p>ClayStack is a pioneering liquid staking protocol designed for the Ethereum ecosystem. Their mission is to lead a new era in the global staking industry, with the aim of bringing staking into the mainstream. Our unique approach, anchored in our commitment to decentralization, security, scalability, and inclusivity, sets us apart. csETH, a key part of our platform, enhances the security of Ethereum and DeFi by fostering active participation and promoting scalable, robust staking.</p> <p>ClayStack has raised $5.2M from investors like Coinbase Ventures and CoinFund and has confirmed to airdrop CLAY tokens to stakers. Stake ETH on the platform to get csETH. You will now start learning CLAY points as well as EigenLayer points. The CLAY points will be converted to CLAY tokens at TGE.</p> <p><strong>Step-by-Step Guide:</strong></p> <ol> <li>Visit the <a href='https://airdrops.io/visit/gam2/' rel='nofollow' target='_blank'>ClasyStack website</a>.</li> <li>Connect your wallet.</li> <li>You will need ETH, rETH or stETH. You can get ETH from <a href='https://airdrops.io/goto/binance/' rel='nofollow' target='_blank'>Binance</a>.</li> <li>Now stake ETH on ClayStack.</li> <li>You will get csETH.</li> <li>Now, you will start earning CLAY points as well as EigenLayer points.</li> <li>A total of 5% of the total supply of CLAY tokens has been allocated for this airdrop.</li> <li>The CLAY points you earn will be converted to CLAY tokens at a 1:1 ratio at TGE.</li> <li>You could also become eligible for the&nbsp;<a href='https://airdrops.io/eigenlayer/'>EigenLayer speculative airdrop</a>&nbsp;for earning EigenLayer points.</li> <li>Also, earn 10% of the CLAY points from each referral.</li> </ol> <p>You&#39;re interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our <a href='https://airdrops.io/speculative/'>list of potential retroactive airdrops</a> to not miss out on the next DeFi airdrop!</p> <p>Don&#39;t forget to follow us on <a href='https://twitter.com/airdrops_io' target='_blank'>Twitter</a>, <a href='https://t.me/airdrops_io' target='_blank'>Telegram</a>, &amp; <a href='https://www.facebook.com/airdrops.io' target='_blank'>Facebook</a> and <a href='https://airdrops.io/newsletter/' target='_blank'>subscribe our newsletter</a> to receive new airdrops!</p> ",
		"claimURL": "https://app.claystack.com/?code=b0oPlA3bhbnlsNYoJdYWeixnRCVh3kC6lxex+Q4SO6NZMuFuF0D8ObKs"
	}
]